src/Documents/СД_Заявка/СД_Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="dd884d26-cef7-4ee5-928a-cf898ed269f2">
  <name>СД_Заявка</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="15f46283-54f7-48ef-a5e8-9eb85aff1153">
    <name>ТемаЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="325efba9-8467-4c2f-85f3-3616245ff630">
    <name>Сервис</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_Сервисы</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e5d59f79-79c9-4f7c-81e1-c7baed11fecb">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СД_СпособыСоздания</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="40d006d1-31b1-4c03-b927-2f3e3232f015">
    <name>ИннициаторЗаявкиАдресЭлПочты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="82253011-7877-4f03-8b69-9b94f487a8f8">
    <name>Примечание</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ef42f5f-532d-4072-8a34-c052799b6365">
    <name>ВидЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ВидыЗаявок</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="75e52cec-543a-4143-bffb-a75f2b219550">
    <name>ИннициаторЗаявкиИмяОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="759a06b0-6d20-49ce-bed2-5a470e74ff85">
    <name>УчетнаяЗаписьПолученияЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="263baaae-a575-4f3e-9970-96da3c1d4231">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="87523878-293d-4a0b-80f8-26e341f648ce">
    <name>ИнициаторЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="7634e8d6-85ec-4663-8376-d377e2c7870d">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="1479f7d5-6902-4658-a27e-fc569da4b92d">
    <name>ПродолжениеЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_Заявка</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8c420815-9453-413a-8229-a2fdba058602">
    <name>ПроблемаИнцидент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_ПроблемаИнцидент</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f6697eea-c58d-4fca-920f-7aafd944fc4d">
    <name>ОборудованиеПредприятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ОборудованиеПредприятия</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="29031e78-6fa3-4c0c-947c-5470ffd8e2ec">
    <name>Ч_ТипЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.Ч_ТипыЗаявокСД</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8409f1b3-8158-4a7e-b764-2c99f6de21f9">
    <name>Ч_ПлановоеВремяЗакрытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="11dd4a2c-ef4b-4e51-a146-5fcd125305f8">
    <name>Ч_Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/СД_Сервисы/СД_Сервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="11512439-e3e0-41fb-a7df-8073bc1d3471">
  <name>СД_Сервисы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="5df694b9-89da-449d-b687-945e2eec8ead">
    <name>ВидЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ВидыЗаявок</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="db82eec1-4afb-4aa9-8038-d1a079a57a8f">
    <name>МоментФормированияТикета</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8436a1b3-9957-4754-994a-002e77a447bf">
    <name>ДиспетчерЗаявок</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="eb0accec-9749-4546-83b6-058789ca898b">
    <name>ОсновнойИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="17ba8715-ad5f-4a85-9409-a9d3882e8b52">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="7f0f6add-58de-4b35-8e8e-fdda35397622">
    <name>БизнесПроцессСервиса</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="32432836-61b8-4c22-a403-50e76c4ae594">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="cedc0547-1602-4da5-a633-fda144e4b269">
    <name>ШаблонУспешнаяРегистрацияЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="ffb0f0ca-9a7b-4c11-8659-50c4b4d5384b">
    <name>ШаблонПодготовленОтветРешение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="15913f0b-e233-4883-804b-aa3a6cbf64b5">
    <name>ШаблонПодготовленОтветПояснение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="54adb12f-66ce-4997-8f70-33a6b15f17e4">
    <name>ШаблонОтказПревышениеЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="28ac2de2-3add-4a02-91bb-a22440fe1033">
    <name>Ч_ПользовательПочты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="2dbc8983-7fa2-4ff7-8b8f-024362a6a9a6">
    <name>Ч_СУО</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3e8a211e-1abd-4df0-855e-8ba3ecae9f64">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.Ч_ТипыЗаявокСД</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="1d54f30b-d019-4c8d-9f6f-ea619d65d4b0">
      <name>Приоритет</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СД_Приоритет</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="3e4f10d9-06e7-4c0f-a343-8310d677d55b">
      <name>Срок</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/СД_Заявка/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция РасчетПлановогоВремениЗакрытия(ДатаВремяНачала, Сервис, Тип, Приоритет)
	
	// По умолчанию срок реагирования 4 часа
	Результат = ДатаВремяНачала + 4 * 3600;
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	СД_СервисыЧ_СУО.Срок КАК Срок
                   |ИЗ
                   |	Справочник.СД_Сервисы.Ч_СУО КАК СД_СервисыЧ_СУО
                   |ГДЕ
                   |	СД_СервисыЧ_СУО.Приоритет = &Приоритет
                   |	И СД_СервисыЧ_СУО.Тип = &Тип
                   |	И СД_СервисыЧ_СУО.Ссылка = &Ссылка";      
	Запрос.УстановитьПараметр("Ссылка", Сервис);
	Запрос.УстановитьПараметр("Тип", Тип);
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
    Данные = Запрос.Выполнить().Выбрать();
	Если Данные.Следующий() Тогда
		Результат = ДатаВремяНачала + Данные.Срок * 3600; // Часы переводим в секунды
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ЧСД_РасчетПлановогоВремениПриИзменении(Элемент)
	// Провести новый расчет планового времени закрытия
	ДатаВремяНачала = Объект.Дата;
	Объект.Ч_ПлановоеВремяЗакрытия = РасчетПлановогоВремениЗакрытия (ДатаВремяНачала, Объект.Сервис, Объект.Ч_ТипЗаявки, ПриоритетЗаявки);	
КонецПроцедуры

&НаКлиенте
Процедура ЧСД_СервисПриИзмененииПосле(Элемент)
	// Провести новый расчет планового времени закрытия
	ЧСД_РасчетПлановогоВремениПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ЧСД_ПриоритетЗаявкиПриИзмененииПосле(Элемент)
	// Провести новый расчет планового времени закрытия
	ЧСД_РасчетПлановогоВремениПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ЧСД_Ч_ТипЗаявкиПриИзмененииПосле(Элемент)
	// Провести новый расчет планового времени закрытия
	ЧСД_РасчетПлановогоВремениПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ЧСД_ПисьмоПосле(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ч_Предмет) Тогда
		
		стрПараметры = Новый Структура("Ключ", Объект.Ч_Предмет);
		ФормаОснования = ПолучитьФорму("Документ.ВходящееПисьмо.ФормаОбъекта", стрПараметры);
		
		Если  ФормаОснования <> Неопределено Тогда
			ФормаОснования.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧСД_ПроцессыИЗадачиПосле(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Предмет", Объект.Ссылка);
	ПараметрыФормы.Вставить(
		"Заголовок",
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процессы и задачи по предмету: ""%1""'"),
			Заголовок));
	ОткрытьФорму(
		"ОбщаяФорма.ПроцессыИЗадачи",
		ПараметрыФормы);

КонецПроцедуры
